УРВ_файловая/src/DataProcessors/СозданиеОбъектовURMExchange/СозданиеОбъектовURMExchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеОбъектовURMExchange</name>
  <tabularSections>
    <name>ДанныеProject</name>
    <attributes>
      <name>NameProject</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>StartDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUIDProject</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеPartner</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>INN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUIDPartner</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеEmployee</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>authentication</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УРВ_файловая/src/Catalogs/Абоненты/Абоненты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Абоненты</name>
  <owners>Catalog.Сервисы</owners>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDОБД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Эталон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНСИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАбонент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегистрационныеНомера</name>
    <attributes>
      <name>РегНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аккаунты</name>
    <attributes>
      <name>CodeAPI</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/DataProcessors/СозданиеОбъектовURMExchange/Forms/ПромежуточнаяФорма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОбъекта = Неопределено;
	
	Если Параметры.Свойство("МассивПроектов") Тогда
		Для Каждого ЗначениеПроект Из Параметры.МассивПроектов Цикл
			СписокПроектов.Добавить(ЗначениеПроект.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных проектов";
		ТипОбъекта = "Проект";
	КонецЕсли;
	
	Если Параметры.Свойство("МассивКонтрагентов") Тогда
		Для Каждого ЗначениеКонтрагент Из Параметры.МассивКонтрагентов Цикл
			СписокКонтрагентов.Добавить(ЗначениеКонтрагент.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных контрагентов";
		ТипОбъекта = "Контрагент";
	КонецЕсли;
	
	Если Параметры.Свойство("МассивАбонентов") Тогда
		Для Каждого ЗначениеАбонент Из Параметры.МассивАбонентов Цикл
			СписокАбонентов.Добавить(ЗначениеАбонент.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных абонентов";
		ТипОбъекта = "Абонент";
	КонецЕсли;
	
	Если Параметры.Свойство("МассивПользователей") Тогда
		Для Каждого ЗначениеПользователь Из Параметры.МассивПользователей Цикл
			СписокПользователей.Добавить(ЗначениеПользователь.Ссылка);
		КонецЦикла;
		ЭтаФорма.Заголовок = "Выбор возможных пользователей";
		ТипОбъекта = "Пользователь";
	КонецЕсли;
	
	УстановитьВидимостьДоступностьНаСервере(ТипОбъекта);
	
КонецПроцедуры

#Область Обработчики_Команд_На_Форме

&НаКлиенте
Процедура ВыбратьКонтрагента(Команда)
	ТекДанные = Элементы.СписокКонтрагентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;	
	ЗакрытьФормуОбъекта(ТекДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПользователя(Команда)
	ТекДанные = Элементы.СписокПользователей.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;	
	ЗакрытьФормуОбъекта(ТекДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроект(Команда)
	ТекДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;
	ЗакрытьФормуОбъекта(ТекДанные.Значение); 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйПроект(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Проект"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоКонтрагента(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Контрагент"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоПользователя(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Пользователь"));
КонецПроцедуры

#КонецОбласти

#Область Служебная

&НаКлиенте
Процедура ЗакрытьФормуОбъекта(Ссылка)
	ЭтаФорма.Закрыть(Новый Структура("ВыбранныйОбъект",Ссылка));
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьНаСервере(ТипОбъекта)
	Элементы.СписокКонтрагентов.Видимость  	= ?(ТипОбъекта = "Контрагент"   , Истина , Ложь);
	Элементы.СписокПользователей.Видимость 	= ?(ТипОбъекта = "Пользователь" , Истина , Ложь);
	Элементы.СписокПроектов.Видимость      	= ?(ТипОбъекта = "Проект"       , Истина , Ложь);
	Элементы.СписокАбонентов.Видимость  	= ?(ТипОбъекта = "Абонент"   	, Истина , Ложь);
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуНаОбъект(ТипОбъекта)
	Если ТипОбъекта = "Проект" Тогда
		Возврат Справочники.Проекты.ПустаяСсылка()
	ИначеЕСли ТипОбъекта = "Пользователь" Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка()
	ИначеЕсли ТипОбъекта = "Контрагент" Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка()
	ИначеЕсли ТипОбъекта = "Абонент" Тогда
		Возврат Справочники.Абоненты.ПустаяСсылка()
	Иначе
		Возврат Неопределено
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ВыбратьАбонента(Команда)
	ТекДанные = Элементы.СписокАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Сообщить("Не удалось открыть объект");
		Возврат
	КонецЕсли;	
	ЗакрытьФормуОбъекта(ТекДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоАбонента(Команда)
	ЗакрытьФормуОбъекта(ПолучитьПустуюСсылкуНаОбъект("Абонент"));
КонецПроцедуры

#КонецОбласти
